hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
// Decodes the "Basic <base64>" credential in hdr into user/pass buffers.
// Returns false for anything that is not a well-formed Basic credential pair,
// which the caller treats exactly as it treats a wrong password.
static bool web_basic_credentials(const char *hdr, char *user, size_t user_size, char *pass, size_t pass_size) {
    if (strncmp(hdr, "Basic ", 6) != 0)
        return false;

    unsigned char decoded[128];
    size_t outlen = 0;
    if (web_base64_decode(decoded, sizeof(decoded) - 1, &outlen, (const unsigned char *)(hdr + 6), strlen(hdr + 6)) != 0)
        return false;
    decoded[outlen] = 0;

    char *sep = strchr((char *)decoded, ':');
    if (!sep)
        return false;
    *sep = 0;

    if (strlen((char *)decoded) >= user_size || strlen(sep + 1) >= pass_size)
        return false;
    strcpy(user, (char *)decoded);
    strcpy(pass, sep + 1);
    return true;
}

// Matches one credential pair against both configured accounts. The read-only
// account is skipped entirely while its username is empty, so an unconfigured
// second account cannot be reached by presenting an empty username.
static web_role_t web_match_role(const char *user, const char *pass) {
    bool admin = web_const_time_streq(user, g_config.http_username) && web_const_time_streq(pass, g_config.http_password);
    bool readonly =
        g_config.http_ro_username[0] != 0 && web_const_time_streq(user, g_config.http_ro_username) && web_const_time_streq(pass, g_config.http_ro_password);

    if (admin)
        return WEB_ROLE_ADMIN;
    if (readonly)
        return WEB_ROLE_READONLY;
    return WEB_ROLE_NONE;
}

web_role_t web_request_role(httpd_req_t *req) {
    // With no administrator username configured there is no password prompt at
    // all, so there is nothing to tell the two accounts apart by and the
    // session is the administrator one - the same bypass web_check_auth()
    // applies.
    if (g_config.http_username[0] == 0)
        return WEB_ROLE_ADMIN;

    char hdr[160];
    if (httpd_req_get_hdr_value_str(req, "Authorization", hdr, sizeof(hdr)) != ESP_OK)
        return WEB_ROLE_NONE;

    char user[64], pass[96];
    if (!web_basic_credentials(hdr, user, sizeof(user), pass, sizeof(pass)))
        return WEB_ROLE_NONE;

    return web_match_role(user, pass);
}

bool web_is_readonly(httpd_req_t *req) {
    return web_request_role(req) == WEB_ROLE_READONLY;
}

bool web_check_auth_admin(httpd_req_t *req) {
    if (!web_check_auth(req))
        return false;
    if (web_request_role(req) == WEB_ROLE_ADMIN)
        return true;

    // A read-only session that reached a writing handler either typed the URL
    // or posted a form the page did not offer it. Either way the answer is the
    // same one it would get with no page at all, and it is deliberately not a
    // 401: re-prompting for credentials would invite the operator to retry an
    // account that is working exactly as configured.
    ESP_LOGW(TAG, "read-only session rejected on %s", req->uri);
    httpd_resp_set_status(req, "403 Forbidden");
    httpd_resp_set_type(req, "text/html");
    web_send_standalone_page(req, "<h1>" TR_FORBIDDEN_READONLY "</h1>");
    return false;
}

bool web_check_auth(httpd_req_t *req) {
    // Same-origin check first, before Basic Auth is even evaluated and before
    // the "no password configured" bypass below: a cross-site request has no
    // business reaching this handler regardless of whether it happens to
    // carry valid cached credentials, and CSRF is the attack that matters
    // most precisely when there is no password to leak in the first place.
    if (req->method == HTTP_POST && !web_check_csrf_origin(req)) {
        httpd_resp_set_status(req, "403 Forbidden");
        httpd_resp_set_type(req, "text/html");
        web_send_standalone_page(req, "<h1>" TR_FORBIDDEN_CSRF "</h1>");
        return false;
    }

    if (g_config.http_username[0] == 0)
        return true; // auth disabled if no user set; same-origin check above still applies

    uint32_t client_ip = web_client_ipv4(req);
    int lockout_remaining_s = web_auth_lockout_remaining_s(client_ip);
    if (lockout_remaining_s > 0) {
        // Reject before even looking at the Authorization header: a locked
        // source doesn't get another guess to spend, and doesn't get any
        // extra timing signal either.
        httpd_resp_set_status(req, "429 Too Many Requests");
        char retry_hdr[16];
        snprintf(retry_hdr, sizeof(retry_hdr), "%d", lockout_remaining_s);
        httpd_resp_set_hdr(req, "Retry-After", retry_hdr);
        httpd_resp_set_type(req, "text/html");
        web_send_standalone_page(req, "<h1>" TR_UNAUTHORIZED "</h1>");
        return false;
    }

    char hdr[160];
    if (httpd_req_get_hdr_value_str(req, "Authorization", hdr, sizeof(hdr)) != ESP_OK) {
        goto challenge; // no Authorization header: first half of the Basic handshake, not a guess
    }
    if (strncmp(hdr, "Basic ", 6) != 0)
        goto challenge; // not a Basic credential: same as no header for counting purposes

    {
        char user[64], pass[96];
        if (!web_basic_credentials(hdr, user, sizeof(user), pass, sizeof(pass)))
            goto need_auth;

        // Constant-time compare: strcmp() short-circuits on the first
        // mismatching byte, which leaks (via response timing) how many
        // leading characters of a guess were correct. Both fields are
        // fixed-size buffers in g_config, so comparing the full field width
        // costs nothing here.
        if (web_match_role(user, pass) != WEB_ROLE_NONE) {
            web_auth_note_success(client_ip);
            return true;
        }
    }

need_auth:
    // Reached only when credentials were actually presented and rejected:
    // a malformed Basic payload, or a user/password mismatch. This is the
    // one case that counts as a guess against the lockout budget.
    web_auth_note_failure(client_ip);

challenge:
    // Sends the 401 challenge without touching the lockout counter: every
    // browser reaches this on the first, credential-less half of the Basic
    // Auth handshake, so it must never be charged against the budget that
    // protects the real guesses handled above.
    httpd_resp_set_status(req, "401 Unauthorized");
    httpd_resp_set_hdr(req, "WWW-Authenticate", "Basic realm=\"" APRS_SOFTWARE_NAME "\"");
    httpd_resp_set_type(req, "text/html");
    web_send_standalone_page(req, "<h1>" TR_UNAUTHORIZED "</h1>");
    return false;
}

