hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
// ---------------------------------------------------------------- Body read
int web_read_body(httpd_req_t *req, char *buf, size_t buf_size) {
    if (req->content_len >= buf_size) {
        ESP_LOGW(TAG, "body too large: %d >= %d", (int)req->content_len, (int)buf_size);
        return -1;
    }
    int total = 0;
    while (total < req->content_len) {
        int r = httpd_req_recv(req, buf + total, req->content_len - total);
        if (r <= 0) {
            if (r == HTTPD_SOCK_ERR_TIMEOUT)
                continue;
            return -1;
        }
        total += r;
    }
    buf[total] = 0;
    return total;
}

// ---------------------------------------------------------------- URL decode
// CR, LF and NUL are dropped as they are decoded rather than passed through:
// every caller of web_form_get() eventually writes the decoded value into a
// line-oriented output (an APRS-IS line, the AX.25 TNC2 text form, a JSON
// config value), and %0D/%0A let an operator smuggle either byte past a
// plain-text form field. Filtering here, at the one place every POSTed form
// value in this firmware is decoded, closes that path for every field
// without relying on each page's own POST handler to do it separately.
void web_urldecode(const char *src, char *dst, size_t dst_size) {
    size_t di = 0;
    while (*src && di + 1 < dst_size) {
        char c;
        if (*src == '%' && isxdigit((unsigned char)src[1]) && isxdigit((unsigned char)src[2])) {
            char hex[3] = { src[1], src[2], 0 };
            c = (char)strtol(hex, NULL, 16);
            src += 3;
        } else if (*src == '+') {
            c = ' ';
            src++;
        } else {
            c = *src++;
        }
        if (!str_is_line_break_char(c))
            dst[di++] = c;
    }
    dst[di] = 0;
}

bool web_form_get(const char *body, const char *key, char *out, size_t out_size) {
    if (!body)
        return false;
    size_t keylen = strlen(key);
    const char *p = body;
    while (p && *p) {
        const char *amp = strchr(p, '&');
        size_t seg_len = amp ? (size_t)(amp - p) : strlen(p);
        if (seg_len > keylen && p[keylen] == '=' && strncmp(p, key, keylen) == 0) {
            const char *valstart = p + keylen + 1;
            size_t vallen = seg_len - keylen - 1;
            char tmp[512];
            if (vallen >= sizeof(tmp))
                vallen = sizeof(tmp) - 1;
            memcpy(tmp, valstart, vallen);
            tmp[vallen] = 0;
            web_urldecode(tmp, out, out_size);
            return true;
        }
        // exact match with no '=' (rare) - checkbox absent case handled by caller default
        p = amp ? amp + 1 : NULL;
    }
    return false;
}

void web_password_value(httpd_req_t *req, const char *stored, char *out, size_t out_size) {
#if ALLOW_SHOW_PASSWORD
    // A read-only session is masked whatever this flag says. The pages that
    // render a secret are readable by both roles, so pre-filling the field
    // with the stored value would hand the Wi-Fi key, the APRS-IS passcode,
    // the bot token and the administrator password itself to an account whose
    // whole point is that it cannot change them.
    if (!web_is_readonly(req)) {
        web_html_attr_escape(stored, out, out_size);
        return;
    }
#else
    (void)req;
#endif
    // The mask holds no character an attribute needs escaping for, so it is
    // copied straight in. An empty secret stays empty: a field that shows the
    // mask means "something is set here", and one that never was should not
    // claim otherwise.
    const char *src = (stored && stored[0]) ? WEB_PASSWORD_MASK : "";
    if (out_size == 0)
        return;
    strncpy(out, src, out_size - 1);
    out[out_size - 1] = 0;
}

bool web_form_get_password(const char *body, const char *key, char *out, size_t out_size) {
#if ALLOW_SHOW_PASSWORD
    return web_form_get(body, key, out, out_size);
#else
    // Read into a probe just wide enough to tell the mask apart from anything
    // else: a longer value is truncated here and so can never compare equal,
    // and a shorter one differs on its own. Only when it is not the mask is
    // the field read again into the caller's buffer, which leaves an
    // untouched form saving every other field without disturbing the secret.
    char probe[sizeof(WEB_PASSWORD_MASK) + 1];
    if (web_form_get(body, key, probe, sizeof(probe)) && strcmp(probe, WEB_PASSWORD_MASK) == 0)
        return true;
    return web_form_get(body, key, out, out_size);
#endif
}

void web_password_toggle(httpd_req_t *req, const char *dom_id) {
#if ALLOW_SHOW_PASSWORD
    // Nothing to reveal in a read-only session: web_password_value() masked
    // the field it would act on, so the control is left out for the same
    // reason it is left out when the flag is 0.
    if (web_is_readonly(req))
        return;

    // The id lands inside a JavaScript string literal that itself sits inside
    // an HTML attribute, where entity escaping would not help: the parser
    // hands the decoded text to the script engine. Every id the pages pass is
    // a plain identifier, so the safe move is to keep only the characters an
    // identifier is made of and drop anything else rather than try to quote
    // it.
    char id[40];
    size_t n = 0;
    for (const char *p = dom_id; *p && n < sizeof(id) - 1; p++) {
        if (isalnum((unsigned char)*p) || *p == '_' || *p == '-')
            id[n++] = *p;
    }
    id[n] = 0;

    char buf[sizeof(id) + sizeof(TR_SHOW_PASSWORD) + 96];
    snprintf(buf, sizeof(buf), "<label class='pwd-show'><input type='checkbox' onclick=\"togglePwd('%s',this)\"> " TR_SHOW_PASSWORD "</label>", id);
    httpd_resp_sendstr_chunk(req, buf);
#else
    (void)req;
    (void)dom_id;
#endif
}

bool web_form_get_bool(const char *body, const char *key) {
    char v[16];
    if (!web_form_get(body, key, v, sizeof(v)))
        return false;
    return (strcmp(v, "on") == 0 || strcmp(v, "1") == 0 || strcasecmp(v, "true") == 0);
}

int web_form_get_int(const char *body, const char *key, int def) {
    char v[32];
    if (!web_form_get(body, key, v, sizeof(v)) || v[0] == 0)
        return def;
    return atoi(v);
}

float web_form_get_float(const char *body, const char *key, float def) {
    char v[32];
    if (!web_form_get(body, key, v, sizeof(v)) || v[0] == 0)
        return def;
    return strtof(v, NULL);
}

// ---------------------------------------------------------------- Output-side escaping
// (web_urldecode above handles the *input* direction, for query strings
// esp_httpd hands us; these three handle the *output* direction, for
// user-supplied strings - chiefly filenames - that get echoed back into
// hrefs/HTML/JS. Skipping this is what let a filename with a space or a
// quote character in it silently break the Storage page's delete/download
// links and onclick handlers.)

void web_urlencode(const char *src, char *dst, size_t dst_size) {
    if (!dst || dst_size == 0)
        return;
    static const char hex[] = "0123456789ABCDEF";
    size_t di = 0;
    for (const unsigned char *p = (const unsigned char *)src; src && *p && di + 1 < dst_size; p++) {
        unsigned char c = *p;
        if (isalnum(c) || c == '-' || c == '_' || c == '.' || c == '~') {
            dst[di++] = (char)c;
        } else {
            if (di + 3 >= dst_size)
                break;
            dst[di++] = '%';
            dst[di++] = hex[(c >> 4) & 0xF];
            dst[di++] = hex[c & 0xF];
        }
    }
    dst[di] = 0;
}

