hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
    // ---- skip preamble up to and including the first boundary delimiter ----
    {
        const uint8_t *p = mp_mem_find(buf, buf_len, delim, (size_t)delim_len);
        if (!p)
            goto done; // no boundary at all: not a well-formed multipart body
        size_t skip = (size_t)(p - buf) + (size_t)delim_len;
        memmove(buf, buf + skip, buf_len - skip);
        buf_len -= skip;
    }

    for (int part_idx = 0; part_idx < MP_MAX_PARTS; part_idx++) {
        // Right after a delimiter: either "--" (terminating boundary, no more
        // parts) or "\r\n" (a part follows).
        if (buf_len < 2)
            MP_FILL();
        if (buf_len < 2) {
            // Body ended right at/after the last part's own closing boundary
            // (no distinguishable final "--" epilogue left to read). If we
            // already streamed a file part, that's a completed upload, not
            // an error - only a genuinely empty/truncated body is malformed.
            result = found_file_part ? ESP_OK : ESP_FAIL;
            goto done;
        }
        if (buf[0] == '-' && buf[1] == '-') {
            result = found_file_part ? ESP_OK : ESP_ERR_NOT_FOUND;
            goto done;
        }
        if (buf[0] != '\r' || buf[1] != '\n')
            goto done; // malformed
        memmove(buf, buf + 2, buf_len - 2);
        buf_len -= 2;

        // ---- part headers, up to the blank line ----
        char headers[MP_MAX_HEADER];
        const uint8_t *hp;
        for (;;) {
            hp = mp_mem_find(buf, buf_len, "\r\n\r\n", 4);
            if (hp)
                break;
            if (buf_len >= MP_BUF_CAP || remaining == 0)
                goto done; // headers too large or body ended mid-header: malformed
            MP_FILL();
        }
        size_t hdrblock_len = (size_t)(hp - buf);
        if (hdrblock_len >= sizeof(headers)) {
            // Don't silently truncate: a truncated copy could miss the
            // Content-Disposition/filename entirely (has_filename would come
            // back false even though the part is really a file part),
            // producing a confusing partial/failed upload instead of a clear
            // error. A legitimate browser upload's per-part headers are a
            // few dozen bytes; anything this large is malformed or hostile.
            goto done;
        }
        memcpy(headers, buf, hdrblock_len);
        headers[hdrblock_len] = 0;
        size_t consumed = hdrblock_len + 4;
        memmove(buf, buf + consumed, buf_len - consumed);
        buf_len -= consumed;

        // ---- does this part carry filename="..."? ----
        bool has_filename = false;
        {
            const char *cdisp = mp_ci_strstr(headers, "Content-Disposition");
            if (cdisp) {
                const char *fn = mp_ci_strstr(cdisp, "filename=\"");
                if (fn) {
                    fn += 10;
                    const char *end = strchr(fn, '"');
                    if (end && end > fn) {
                        has_filename = true;
                        if (filename_out && filename_out_size) {
                            size_t flen = (size_t)(end - fn);
                            if (flen >= filename_out_size)
                                flen = filename_out_size - 1;
                            memcpy(filename_out, fn, flen);
                            filename_out[flen] = 0;
                        }
                    }
                }
            }
        }
        bool stream_this = has_filename && !found_file_part;

        // ---- part data, up to the next "\r\n--boundary" ----
        for (;;) {
            const uint8_t *cm = mp_mem_find(buf, buf_len, close_marker, (size_t)close_len);
            if (cm) {
                size_t data_len = (size_t)(cm - buf);
                if (stream_this && data_len > 0 && cb(cb_ctx, buf, data_len) != ESP_OK)
                    goto done;
                size_t used = data_len + (size_t)close_len;
                memmove(buf, buf + used, buf_len - used);
                buf_len -= used;
                break;
            }
            // No full marker in the buffer yet: flush everything except the
            // tail that could still be a prefix of the marker, then refill.
            size_t keep = (size_t)close_len - 1;
            if (buf_len > keep) {
                size_t flush = buf_len - keep;
                if (stream_this && cb(cb_ctx, buf, flush) != ESP_OK)
                    goto done;
                memmove(buf, buf + flush, buf_len - flush);
                buf_len -= flush;
            }
            if (remaining == 0)
                goto done; // ran out of body before finding the closing boundary: truncated/malformed
            MP_FILL();
        }

        if (has_filename)
            found_file_part = true;
        // loop back: buffer now starts right after this part's boundary
        // delimiter, exactly the state the top of the loop expects.
    }
    // MP_MAX_PARTS exceeded without reaching a terminating boundary.
    result = ESP_FAIL;

done:
    free(buf);
#undef MP_FILL
    return result;
}

// ---------------------------------------------------------------- HTML shell
// Sidebar menu: one row per page, in the order the sidebar renders them.
// Each row is compiled in only when its module's ENABLE_* macro is defined,
// so a page left out of the build leaves no dead link behind.
struct menu_item {
    const char *href;
    const char *label;
    const char *key;
};
static const struct menu_item MENU[] = {
#ifdef ENABLE_DASHBOARD
    { "/dashboard", TR_MENU_DASHBOARD, "dashboard" },
#endif
#ifdef ENABLE_STATION
    { "/station", TR_MENU_STATION, "station" },
#endif
#ifdef ENABLE_MSG_CHAT
    { "/msgchat", TR_MENU_MSGCHAT, "msgchat" },
#endif
#ifdef ENABLE_BULLETINS
    { "/bulletins", TR_MENU_BULLETINS, "bulletins" },
#endif
#ifdef ENABLE_OBJECTS_ITEMS
    { "/objects", TR_MENU_OBJITEMS, "objects" },
#endif
#ifdef ENABLE_RADIO_MODEM
    { "/radio", TR_MENU_RADIO, "radio" },
#endif
#ifdef ENABLE_MESSAGE
    { "/msg", TR_MENU_MSG, "msg" },
#endif
#ifdef ENABLE_QUERY
    { "/query", TR_MENU_QUERY, "query" },
#endif
#ifdef ENABLE_IGATE
    { "/igate", TR_MENU_IGATE, "igate" },
#endif
#ifdef ENABLE_BRANDMEISTER
    { "/bm", TR_MENU_BM, "bm" },
#endif
#ifdef ENABLE_DIGIPEATER
    { "/digi", TR_MENU_DIGI, "digi" },
#endif
#ifdef ENABLE_TRACKER
    { "/tracker", TR_MENU_TRACKER, "tracker" },
#endif
#ifdef ENABLE_WEATHER
    { "/wx", TR_MENU_WX, "wx" },
#endif
#ifdef ENABLE_TELEMETRY
    { "/tlm", TR_MENU_TLM, "tlm" },
#endif
#ifdef ENABLE_GPS
    { "/gps", TR_MENU_GPS, "gps" },
#endif
#ifdef ENABLE_TELEGRAM
    { "/telegram", TR_MENU_TELEGRAM, "telegram" },
#endif
#ifdef ENABLE_WINLINK
    { "/winlink", TR_MENU_WINLINK, "winlink" },
#endif
#ifdef ENABLE_LOGS
    { "/logs", TR_MENU_LOGS, "logs" },
#endif
#ifdef ENABLE_SYSTEM
    { "/system", TR_MENU_SYSTEM, "system" },
#endif
#ifdef ENABLE_WIRELESS
    { "/wireless", TR_MENU_WIRELESS, "wireless" },
#endif
#ifdef ENABLE_FILE_STORAGE
    { "/storage", TR_MENU_STORAGE, "storage" },
#endif
#ifdef ENABLE_ABOUT_FIRMWARE
    { "/about", TR_MENU_ABOUT, "about" },
#endif
};
#define MENU_COUNT (sizeof(MENU) / sizeof(MENU[0]))

void web_send_header(httpd_req_t *req, const char *title, const char *active_menu) {
    httpd_resp_set_type(req, "text/html");
    // Config pages render live g_config values into the form on every GET.
    // Without this header, browsers (especially after a POST->redirect->GET
    // save flow) may serve a cached copy of the page instead of re-fetching,
    // so a value that was just saved appears not to have been saved at all.
    httpd_resp_set_hdr(req, "Cache-Control", "no-store, no-cache, must-revalidate");
    httpd_resp_set_hdr(req, "Pragma", "no-cache");
    // The nav-toggle checkbox carries the drawer's open/closed state on narrow
    // screens and is a sibling of both the top bar and the layout, so the
    // burger, the drawer and its backdrop are all driven from it by the
    // stylesheet alone. On a wide screen the burger and the backdrop are not
    // displayed and the menu renders as the fixed sidebar beside the content,
    // so the same markup serves every viewport and the state resets by itself
    // on each navigation.
    //
    // The brand logo is an image request rather than an inline data URI, so the
    // browser caches it once and the bytes stay out of every page's markup. Its
    // intrinsic size travels with the tag, which reserves the right width in the
    // bar before the image itself has arrived. The empty alt marks it as
    // decorative: the station name beside it already carries the meaning, and a
    // screen reader announcing both would only say it twice.
    httpd_resp_sendstr_chunk(req, "<!DOCTYPE html><html><head><meta charset='utf-8'>"
                                  "<meta name='viewport' content='width=device-width,initial-scale=1'>"
                                  "<link rel='stylesheet' href='/style.css'>"
                                  "<title>" APRS_SOFTWARE_NAME "</title></head><body>"
                                  "<input type='checkbox' id='navtoggle' class='nav-toggle' aria-label='" TR_NAV_MENU "'>"
                                  "<div class='topbar'>"
                                  "<label for='navtoggle' class='nav-burger' title='" TR_NAV_MENU "'>"
                                  "<span></span><span></span><span></span></label>"
                                  "<span class='brand'>"
                                  "<img class='brand-mark' src='/logo.png' alt='' "
                                  "width='" WEB_LOGO_PNG_WIDTH_STR "' height='" WEB_LOGO_PNG_HEIGHT_STR "'>"
                                  "<span class='brand-text'>" TR_BRAND "</span></span>"
                                  "<div class='topbar-right'><a class='logout' href='/logout'>" TR_LOGOUT "</a></div></div>"
                                  "<div class='layout'><nav class='sidebar'><ul>");

    for (size_t i = 0; i < MENU_COUNT; i++) {
        char line[160];
        bool is_active = active_menu && strcmp(active_menu, MENU[i].key) == 0;
        snprintf(line, sizeof(line), "<li><a href='%s'%s>%s</a></li>", MENU[i].href, is_active ? " class='active'" : "", MENU[i].label);
        httpd_resp_sendstr_chunk(req, line);
    }
    httpd_resp_sendstr_chunk(req, "</ul></nav><label for='navtoggle' class='nav-scrim'></label><main class='content'>");

    // A read-only session is told so once per page, above everything else on
    // it. The forms below are rendered exactly as the administrator sees them
    // and then disabled by the script web_send_footer() appends, so without
    // this line the page would look like an editor that has stopped
    // responding rather than like the viewer it is.
    if (web_is_readonly(req))
        httpd_resp_sendstr_chunk(req, "<p class='ro-banner'>" TR_RO_BANNER "</p>");

    if (title) {
        httpd_resp_sendstr_chunk(req, "<h1>");
        httpd_resp_sendstr_chunk(req, title);
        httpd_resp_sendstr_chunk(req, "</h1>");
    }
}

void web_send_footer(httpd_req_t *req) {
#if ALLOW_SHOW_PASSWORD
    // Only reaches the browser while secrets do. With ALLOW_SHOW_PASSWORD at 0
    // the fields carry a placeholder and no page emits the checkbox that would
    // call this, so the script would have nothing to act on.
    httpd_resp_sendstr_chunk(
        req, "<script>function togglePwd(id,cb){var el=document.getElementById(id);if(el){el.type=(cb&&cb.checked)?'text':'password';}}</script>");
#endif

    // Places the contextual help balloon. The stylesheet gives it position:
    // fixed, which is what lets it be painted over every card, accordion and
    // table frame on the page instead of being clipped by the one it was
    // opened from; what a stylesheet cannot then supply is where on the
    // viewport it goes, and that is all this does.
    //
    // The balloon is measured before it is placed, with the measurement done
    // on an off-screen copy of the displayed state rather than by trusting
    // :hover to have been applied by the time the event arrives. Placement
    // then centres it over the marker, pulls it back inside whichever screen
    // edge it would cross, flips it under the field when there is not enough
    // room above, and slides the arrow along its edge so it still points at
    // the marker after any of that. Because a fixed element does not travel
    // with the page, the open balloon is placed again on scroll and resize;
    // the scroll listener is a capturing one so it also sees the log, chat and
    // table frames that scroll inside themselves.
    //
    // Listening on the document rather than on each marker means one pair of
    // handlers serves every option on the page, including rows a page's own
    // script adds after load.
    httpd_resp_sendstr_chunk(req, "<script>(function(){"
                                  "var cur=null;"
                                  "function place(h){"
                                  "var b=h.querySelector('.hlp-box');"
                                  "if(!b)return;"
                                  "b.classList.remove('below');"
                                  "b.style.visibility='hidden';"
                                  "b.style.display='block';"
                                  "b.style.left='0px';"
                                  "b.style.top='0px';"
                                  "var m=h.getBoundingClientRect();"
                                  "var w=b.offsetWidth,t=b.offsetHeight,g=8;"
                                  "var vw=document.documentElement.clientWidth;"
                                  "var vh=document.documentElement.clientHeight;"
                                  "var cx=m.left+m.width/2;"
                                  "var x=cx-w/2;"
                                  "if(x+w>vw-g)x=vw-g-w;"
                                  "if(x<g)x=g;"
                                  "var y=m.top-t-g;"
                                  "if(y<g){y=m.bottom+g;b.classList.add('below');}"
                                  "if(y+t>vh-g)y=Math.max(g,vh-g-t);"
                                  "var a=cx-x;"
                                  "if(a<10)a=10;"
                                  "if(a>w-10)a=w-10;"
                                  "b.style.left=Math.round(x)+'px';"
                                  "b.style.top=Math.round(y)+'px';"
                                  "b.style.setProperty('--hlp-arrow',Math.round(a)+'px');"
                                  "b.style.display='';"
                                  "b.style.visibility='';"
                                  "cur=h;"
                                  "}"
                                  "function marker(n){"
                                  "while(n&&n!==document){"
                                  "if(n.classList&&n.classList.contains('hlp'))return n;"
                                  "n=n.parentNode;"
                                  "}"
                                  "return null;"
                                  "}"
                                  "function show(e){var h=marker(e.target);if(h)place(h);}"
                                  "function hide(e){if(cur&&marker(e.target)===cur)cur=null;}"
                                  "function follow(){if(cur)place(cur);}"
                                  "document.addEventListener('mouseover',show,true);"
                                  "document.addEventListener('focusin',show,true);"
                                  "document.addEventListener('mouseout',hide,true);"
                                  "document.addEventListener('focusout',hide,true);"
                                  "document.addEventListener('scroll',follow,true);"
                                  "window.addEventListener('resize',follow);"
                                  "})();</script>");

    // Read-only chrome. This is the cosmetic half of the role boundary and
    // nothing rests on it: every handler that writes begins with
    // web_check_auth_admin(), so a control re-enabled from a browser console
    // buys a 403 and nothing else. What it buys the operator is a page that
    // says what it can do - a greyed-out form reads as "not yours to change",
    // where a live one that silently refuses reads as a broken station.
    //
    // Two kinds of control stay live. The navigation checkbox carries the
    // drawer's open/closed state on a narrow screen and is not a form field at
    // all, and anything a page marks .ro-ok is a view control rather than a
    // station control: the log console's Start/Stop and the dashboard's
    // traffic pause and clear, none of which change anything outside the
    // browser window they are pressed in.
    //
    // The pass is re-run on every DOM change because several pages build rows
    // from their own script after load - the Winlink message list, the chat
    // history - and a control that appears a second later has to arrive
    // disabled too. Only childList mutations are watched, so the disabling
    // this does cannot trigger itself.
    if (web_is_readonly(req))
        httpd_resp_sendstr_chunk(req, "<script>(function(){"
                                      "function lock(){"
                                      "var e=document.querySelectorAll('input,select,textarea,button');"
                                      "for(var i=0;i<e.length;i++){"
                                      "if(e[i].id==='navtoggle')continue;"
                                      "if(e[i].classList&&e[i].classList.contains('ro-ok'))continue;"
                                      "e[i].disabled=true;"
                                      "}"
                                      "var f=document.querySelectorAll('form');"
                                      "for(var j=0;j<f.length;j++)f[j].onsubmit=function(){return false;};"
                                      "}"
                                      "lock();"
                                      "if(window.MutationObserver)"
                                      "new MutationObserver(lock).observe(document.body,{childList:true,subtree:true});"
                                      "})();</script>");

    httpd_resp_sendstr_chunk(req, "</main></div></body></html>");
    httpd_resp_sendstr_chunk(req, NULL); // end chunked response
}

void web_send_standalone_page(httpd_req_t *req, const char *body_html) {
    // Every response that is not a full admin page still has to read on a
    // phone. These bodies are short and are shown outside the admin chrome,
    // so they carry their own head instead of linking /style.css: the
    // viewport declaration is what stops a handset from laying the page out
    // at desktop width and then scaling the result down to unreadable, and
    // the few rules below give the text a comfortable measure and the same
    // face as the rest of the UI. Colours are spelled out literally here
    // because the var(--...) custom properties are defined by the stylesheet
    // this page deliberately does not load.
    httpd_resp_sendstr_chunk(req, "<!DOCTYPE html><html><head><meta charset='utf-8'>"
                                  "<meta name='viewport' content='width=device-width,initial-scale=1'>"
                                  "<style>"
                                  "html{-webkit-text-size-adjust:100%;text-size-adjust:100%;}"
                                  "body{font-family:'Segoe UI',system-ui,sans-serif;color:#111827;background:#f6f7f9;"
                                  "margin:0;padding:24px 16px;max-width:640px;overflow-wrap:anywhere;line-height:1.5;}"
                                  "h1{font-size:1.25em;margin:0 0 12px;}"
                                  "p{margin:8px 0;}"
                                  "a{color:#2f6fed;}"
                                  ".err{color:#dc2626;font-weight:600;}"
                                  "</style></head><body>");
    httpd_resp_sendstr_chunk(req, body_html);
    httpd_resp_sendstr_chunk(req, "</body></html>");
    httpd_resp_sendstr_chunk(req, NULL); // end chunked response
}

void web_send_save_result(httpd_req_t *req, bool ok, const char *location) {
    // Sized for the longest translation of either body plus two copies of the
    // location, so neither branch can be truncated by snprintf().
    char buf[512];

