hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store, no-cache, must-revalidate");
    httpd_resp_set_hdr(req, "Pragma", "no-cache");

    if (ok) {
        // The redirect is declared in the body rather than the head because
        // the head belongs to web_send_standalone_page(); a meta refresh is
        // honoured wherever in the document it appears.
        snprintf(buf, sizeof(buf), "<meta http-equiv='refresh' content='1;url=%s'><p>" TR_SAVED_REDIRECT "</p>", location);
    } else {
        // No meta refresh on this branch: the page the user came from is
        // rendered from the live settings, so bouncing straight back to it
        // would redisplay exactly what was typed and read as a success. The
        // failure stays on screen until the operator follows the link.
        snprintf(buf, sizeof(buf), "<p class='err'>" TR_SAVE_FAILED "</p><p><a href='%s'>&larr; %s</a></p>", location, location);
    }

    web_send_standalone_page(req, buf);
}

#if ALLOW_SHOW_PASSWORD
#define WEB_CSS_PWD_SHOW ".pwd-show{display:block;font-size:.72em;font-weight:400;margin:4px 0 0;color:var(--sub);}"
#else
#define WEB_CSS_PWD_SHOW ""
#endif

esp_err_t web_handle_css(httpd_req_t *req) {
    static const char *css =
        // Palette/typography matched to hiperiondev/ESP32_WSPR's embedded web admin
        ":root{--bg:#f6f7f9;--card:#ffffff;--border:#e6e8ec;--accent:#2f6fed;"
        "--green:#1a7f37;--red:#dc2626;--text:#111827;--sub:#6b7280;"
        "--shadow:0 1px 3px rgba(0,0,0,.06),0 1px 2px rgba(0,0,0,.04);"
        "--radius-card:14px;--radius-pill:999px;"
        // Height of the top bar, shared by the layout's minimum height and by
        // the off-canvas drawer that sits under it on narrow screens, so all
        // three stay aligned from one value.
        "--topbar-h:56px;--gutter:28px;}"
        "*{box-sizing:border-box;margin:0;padding:0;}"
        // text-size-adjust keeps a phone in landscape from inflating the body
        // text on its own, which would undo the breakpoints below.
        "html{-webkit-text-size-adjust:100%;text-size-adjust:100%;}"
        "body{font-family:'Segoe UI',system-ui,sans-serif;background:var(--bg);color:var(--text);}"
        // Long unbroken tokens are ordinary content here - callsigns with
        // paths, APRS-IS filter strings, raw packets, file names - and a
        // viewport narrower than one of them would otherwise be widened by it.
        "body,td,th,p,li,label{overflow-wrap:anywhere;}"
        "img{max-width:100%;height:auto;}"
        ".topbar{display:flex;justify-content:space-between;align-items:center;gap:12px;"
        "height:var(--topbar-h);padding:0 var(--gutter);"
        "background:var(--card);border-bottom:1px solid var(--border);box-shadow:0 1px 2px rgba(0,0,0,.03);}"
        ".topbar .brand{display:flex;flex:1;align-items:center;gap:10px;font-weight:700;color:var(--text);font-size:1.05em;min-width:0;}"
        ".topbar .brand-text{overflow:hidden;text-overflow:ellipsis;white-space:nowrap;}"
        // Brand logo. Only the height is declared: with width:auto the browser
        // derives the width from the image's own proportions, so the PNG is the
        // single source of truth for its aspect ratio and replacing it with a
        // differently-shaped one needs no change here. The height has to be
        // stated explicitly all the same, because the global img rule above
        // sets height:auto and would otherwise draw the image at its full
        // intrinsic size. 32px inside the 56px bar leaves the logo clear of the
        // bar's edges, and the width that follows from it stays short enough to
        // leave the brand text its room.
        ".topbar .brand-mark{height:32px;width:auto;flex:none;}"
        ".topbar-right{display:flex;align-items:center;gap:10px;border:1px solid var(--border);"
        "border-radius:var(--radius-pill);padding:6px 16px;background:var(--bg);flex:none;}"
        ".topbar .logout{color:var(--sub);text-decoration:none;font-size:.85em;font-weight:600;}"
        ".topbar .logout:hover{color:var(--red);}"
        // Navigation drawer control. The checkbox carries the open/closed
        // state and is a sibling of both the top bar and the layout, so the
        // burger, the drawer and the scrim are all driven from it in CSS
        // alone - no script, and the state resets by itself on every
        // navigation. It is moved out of sight rather than hidden with
        // display:none so it stays reachable by keyboard.
        ".nav-toggle{position:absolute;width:1px;height:1px;opacity:0;pointer-events:none;}"
        ".nav-burger{display:none;flex:none;width:40px;height:40px;flex-direction:column;"
        "align-items:center;justify-content:center;gap:4px;cursor:pointer;"
        "border:1px solid var(--border);border-radius:9px;background:var(--bg);}"
        ".nav-burger span{display:block;width:18px;height:2px;border-radius:2px;background:var(--text);}"
        ".nav-toggle:focus-visible+.topbar .nav-burger{border-color:var(--accent);box-shadow:0 0 0 2px rgba(47,111,237,.35);}"
        ".layout{display:flex;align-items:flex-start;min-height:calc(100vh - var(--topbar-h));}"
        ".sidebar{width:220px;flex:none;align-self:stretch;background:var(--card);"
        "border-right:1px solid var(--border);box-shadow:1px 0 3px rgba(0,0,0,.03);padding:16px 0;}"
        ".sidebar ul{list-style:none;}"
        ".sidebar li a{display:block;padding:10px 18px;color:var(--text);text-decoration:none;"
        "font-size:.85em;border-left:3px solid transparent;transition:.15s;}"
        ".sidebar li a:hover{background:var(--bg);border-left-color:var(--border);}"
        ".sidebar li a.active{background:#eaf1ff;color:var(--accent);font-weight:700;border-left-color:var(--accent);}"
        // Dimmed backdrop behind the open drawer. It is a label for the same
        // checkbox, so tapping anywhere outside the menu closes it.
        ".nav-scrim{display:none;}"
        // min-width:0 is what lets this column shrink below the width of its
        // widest child. Without it a flex item refuses to go under its content
        // width, so one wide table would push the whole page sideways instead
        // of scrolling inside its own frame.
        ".content{flex:1;min-width:0;padding:24px var(--gutter);max-width:1000px;}"
        "h1{color:var(--text);font-size:1.5em;font-weight:800;margin-bottom:18px;}"
        "fieldset{background:var(--card);border:1px solid var(--border);border-radius:var(--radius-card);"
        "box-shadow:var(--shadow);margin-bottom:20px;padding:20px 22px;min-width:0;}"
        "legend{width:100%;color:var(--text);padding:0;margin:0 0 14px;font-size:1.05em;font-weight:700;}"
        // At-a-glance metric strip (dashboard System Info and similar live
        // stats): a row of equal cards, each with a small uppercase label and
        // a large value, matching the admin UI's stat-card look everywhere
        // it is used. The auto-fit track keeps the cards a readable width and
        // re-flows them into as many columns as the viewport holds, down to a
        // single column on a phone.
        ".stat-grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(150px,1fr));gap:14px;}"
        ".stat-card{min-width:0;background:var(--card);border:1px solid var(--border);"
        "border-radius:var(--radius-card);padding:14px 16px;}"
        ".stat-label{color:var(--sub);font-size:.72em;font-weight:700;letter-spacing:.04em;"
        "text-transform:uppercase;margin-bottom:8px;}"
        ".stat-value{color:var(--text);font-size:1.4em;font-weight:800;}"
        ".stat-unit{color:var(--sub);font-size:.55em;font-weight:600;}"
        "label{display:block;color:var(--sub);font-size:.8em;margin:12px 0 4px;}"
        "label:first-child{margin-top:0;}"
        "p label{display:inline;}"
        // Styles the "Show password" checkbox web_password_toggle() writes, so
        // it is carried only in the builds that emit it.
        WEB_CSS_PWD_SHOW "input[type=text],input[type=password],input[type=number],select,textarea{"
        "width:100%;max-width:100%;padding:8px 10px;border:1px solid var(--border);border-radius:8px;"
        "background:#fff;color:var(--text);font-size:.9em;outline:none;transition:.2s;}"
        "input:focus,select:focus,textarea:focus{border-color:var(--accent);}"
        "input[type=checkbox]{width:16px;height:16px;cursor:pointer;accent-color:var(--accent);margin-right:6px;}"
        ".row{display:flex;gap:16px;flex-wrap:wrap;}"
        ".row>div{flex:1;min-width:160px;}"
        "button,.btn{background:var(--accent);color:#fff;border:0;border-radius:8px;"
        "padding:10px 20px;font-weight:700;cursor:pointer;font-size:.9em;text-decoration:none;"
        "display:inline-block;margin-top:10px;transition:.2s;}"
        "button:hover,.btn:hover{background:#245bc4;}"
        "button.secondary,.btn.secondary{background:#eef1f5;color:var(--sub);}"
        "button.secondary:hover,.btn.secondary:hover{background:#e2e6ec;}"
        "button.danger,.btn.danger{background:#fef2f2;color:var(--red);border:1px solid var(--red);}"
        "button.danger:hover,.btn.danger:hover{background:var(--red);color:#fff;}"
        ".btnrow{flex-wrap:wrap;}"
        // Every table on every page is emitted inside one of these frames. A
        // table sizes itself to its own columns and cannot be made narrower
        // without folding its cells, so the frame is what absorbs the
        // difference: the table keeps its full width and scrolls sideways
        // within the page instead of widening it.
        ".table-wrap{width:100%;max-width:100%;overflow-x:auto;-webkit-overflow-scrolling:touch;}"
        "table{border-collapse:collapse;width:100%;font-size:.82em;}"
        "table th,table td{border:1px solid var(--border);padding:7px 9px;text-align:left;}"
        "table th{background:var(--bg);color:var(--sub);}"
        ".login-box{max-width:340px;width:100%;margin:min(80px,10vh) auto;background:var(--card);padding:28px;"
        "border-radius:var(--radius-card);box-shadow:var(--shadow);border:1px solid var(--border);}"
        ".login-box h1{border:0;text-align:center;}"
        ".msg-ok{color:var(--green);} .msg-err{color:var(--red);}"
        // Read-only session banner: the same amber the warning badge uses, as
        // a full-width strip above the page so it is read before the form it
        // describes rather than found afterwards.
        ".ro-banner{margin:0 0 16px;padding:10px 14px;border-radius:var(--radius-card);"
        "background:#fef3c7;color:#92400e;border:1px solid #fcd34d;font-size:.82em;font-weight:600;}"
        // A control the read-only pass switched off still has to be legible:
        // the browser's own disabled rendering washes the text out to the
        // point of being unreadable on some engines, so the text colour is
        // kept and the state is carried by the muted surface and the cursor.
        "input:disabled,select:disabled,textarea:disabled{background:var(--bg);color:var(--sub);cursor:not-allowed;}"
        "button:disabled,.btn:disabled{opacity:.55;cursor:not-allowed;}"
        ".badge{display:inline-block;padding:3px 10px;border-radius:var(--radius-pill);"
        "font-size:.72em;font-weight:700;letter-spacing:.02em;text-transform:uppercase;}"
        ".badge.ok{background:#d1fae5;color:var(--green);}"
        ".badge.warn{background:#fef3c7;color:#92400e;}"
        ".badge.err{background:#fee2e2;color:var(--red);}"
        ".badge.off{background:#e5e7eb;color:#4b5563;}"
        // CSS-only toggle switch: wraps the checkbox in a track+knob pair
        // driven purely by :checked, so it needs no script and keeps the
        // checkbox's own name/id/checked semantics untouched. Used only where
        // a checkbox represents a single on/off feature enable, never for a
        // multi-select checkbox list (see web_field_checkbox_plain()).
        "label.switch-row{display:flex;align-items:center;gap:10px;cursor:pointer;margin:12px 0 4px;}"
        "label.switch-row:first-child{margin-top:0;}"
        ".switch{position:relative;display:inline-block;width:40px;height:22px;flex:none;}"
        ".switch input{position:absolute;opacity:0;width:0;height:0;}"
        ".switch .slider{position:absolute;inset:0;background:#cbd5e1;border-radius:var(--radius-pill);transition:.2s;}"
        ".switch .slider::before{content:'';position:absolute;height:16px;width:16px;left:3px;top:3px;"
        "background:#fff;border-radius:50%;box-shadow:0 1px 2px rgba(0,0,0,.25);transition:.2s;}"
        ".switch input:checked+.slider{background:var(--green);}"
        ".switch input:checked+.slider::before{transform:translateX(18px);}"
        ".switch input:focus+.slider{box-shadow:0 0 0 2px rgba(47,111,237,.35);}"
        ".switch-label{color:var(--text);font-size:.85em;}"
        // Contextual help marker: the small orange circled question mark that
        // closes every option label, and the balloon it opens. The balloon is
        // revealed from the marker's own :hover and :focus, so it holds no
        // state - a page load leaves every balloon closed. :focus is what
        // makes it reachable without a mouse: the marker is focusable, so a
        // keyboard tab and a touch-screen tap both open it the same way a
        // pointer does.
        ".hlp{display:inline-flex;align-items:center;justify-content:center;"
        "width:14px;height:14px;margin-left:5px;border-radius:50%;background:#f59e0b;color:#fff;"
        "font-size:10px;font-weight:700;line-height:1;cursor:help;vertical-align:middle;flex:none;}"
        ".hlp:focus{outline:2px solid var(--accent);outline-offset:1px;}"
        ".hlp-mark{pointer-events:none;}"
        // The balloon is positioned against the viewport rather than against
        // the marker it belongs to. A marker sits inside a card, an accordion
        // or a table frame, and several of those clip what leaves them - the
        // accordion hides its overflow so its rounded corners stay clean, and
        // a table frame that scrolls sideways clips vertically as well. A
        // balloon laid out inside any of them would be cut off at the frame's
        // edge exactly when it is longer than the space left above the field.
        // Taking it out of the flow entirely is what lets it be drawn whole
        // over every card, table and control on the page, whichever of them it
        // is opened from.
        //
        // The coordinates are the one thing a stylesheet cannot supply for a
        // fixed element, so web_send_footer()'s script measures the marker and
        // writes top/left, the arrow offset in --hlp-arrow, and the .below
        // class when the balloon has to hang under the field instead of over
        // it. The values here are only the resting state before that runs.
        //
        // The balloon is kept out of the pointer's reach so that moving
        // towards it never counts as leaving the marker, which would close it
        // halfway through the sentence being read.
        ".hlp-box{display:none;position:fixed;top:0;left:0;z-index:1000;"
        "width:max-content;max-width:min(300px,calc(100vw - 24px));padding:8px 10px;border-radius:8px;"
        "background:#1f2937;color:#f9fafb;font-size:11px;font-weight:400;line-height:1.35;"
        "text-align:left;white-space:normal;cursor:auto;pointer-events:none;"
        "box-shadow:0 4px 12px rgba(0,0,0,.25);}"
        // The arrow tracks the marker along the balloon's edge, since a
        // balloon pushed away from a screen edge is no longer centred on the
        // field it explains. It points down from the underside by default and
        // up from the top when .below has flipped the balloon.
        ".hlp-box::after{content:'';position:absolute;top:100%;left:var(--hlp-arrow,50%);transform:translateX(-50%);"
        "border:5px solid transparent;border-top-color:#1f2937;}"
        ".hlp-box.below::after{top:auto;bottom:100%;border-top-color:transparent;border-bottom-color:#1f2937;}"
        ".hlp:hover .hlp-box,.hlp:focus .hlp-box,.hlp:focus-within .hlp-box{display:block;}"
        // Reusable light-blue callout for explanatory text under a control,
        // available for any page that wants it.
        ".info-box{background:#eef4ff;border:1px solid #cfe0fb;color:#33456b;"
        "border-radius:10px;padding:10px 14px;font-size:.82em;}"
        ".traffic-actions{display:flex;flex-wrap:wrap;gap:8px;margin-bottom:10px;}"
        ".traffic-actions .btn{margin-top:0;padding:6px 12px;font-size:.8em;}"
        // The traffic table is the one frame that scrolls on both axes: it
        // holds more rows than fit on screen as well as more columns than fit
        // across a phone.
        ".traffic-table-wrap{max-height:360px;overflow:auto;-webkit-overflow-scrolling:touch;}"
        "#trafficTable td{font-family:'Consolas','Courier New',monospace;font-size:.95em;"
        "white-space:nowrap;overflow:hidden;text-overflow:ellipsis;max-width:340px;}"
        "#trafficTable th:nth-child(4),#trafficTable td:nth-child(4){max-width:420px;}"
        // Chat panel (Snd/Rcv Msg page): its height is set from the page's own
        // script, to the exact height of the last few message bubbles, so the
        // panel shows that many messages and scrolls through the rest of the
        // stored conversation. The bounds here only frame that: min-height
        // keeps the panel a readable size while the conversation is empty or
        // one line long, max-height keeps tall messages from pushing the
        // compose row off a short screen.
        ".chat-box{min-height:120px;max-height:70vh;overflow-y:auto;display:flex;flex-direction:column;"
        "gap:8px;padding:10px;background:var(--bg);border:1px solid var(--border);border-radius:8px;}"
        ".chat-empty{color:var(--sub);font-size:.85em;text-align:center;padding:20px 0;}"
        ".chat-bubble{max-width:min(78%,560px);padding:8px 12px;border-radius:12px;font-size:.85em;word-break:break-word;}"
        ".chat-bubble .chat-meta{display:block;font-size:.75em;opacity:.7;margin-bottom:3px;}"
        ".chat-bubble.rx{align-self:flex-start;background:#e8e7e3;color:var(--text);border-bottom-left-radius:2px;}"
        ".chat-bubble.tx{align-self:flex-end;background:var(--accent);color:#fff;border-bottom-right-radius:2px;}"
        ".chat-bubble.tx.pending{background:#7d9be8;}"
        ".chat-compose{margin-top:14px;}"
        ".chat-compose .row{align-items:flex-start;}"
        ".chat-counter{font-size:.72em;color:var(--sub);text-align:right;margin-top:2px;}"
        "#msgChatStatus{font-size:.8em;margin-top:8px;display:block;}"
        // Per-message action row of the Winlink mailbox: the commands that act
        // on one listed message, rendered under the bubble holding that line.
        // Left-aligned like the bubble it belongs to and set in smaller
        // buttons, so a listing of several messages still reads as a listing
        // rather than as a wall of controls.
        ".wl-msg-acts{align-self:flex-start;display:flex;flex-wrap:wrap;gap:6px;margin:-4px 0 2px 4px;}"
        ".wl-msg-acts button{margin-top:0;padding:4px 10px;font-size:.75em;}"
        // Collapsible analog-channel accordion (Telemetry page): one card per
        // channel, header always visible (tag + name + live value + caret),
        // body only rendered for the currently-open channel.
        ".faint{color:var(--sub);opacity:.8;}"
        ".achan{border:1px solid var(--border);border-radius:8px;margin-bottom:10px;overflow:hidden;background:var(--bg);}"
        ".achan:last-child{margin-bottom:0;}"
        ".achan-head{display:flex;align-items:center;gap:10px;padding:11px 12px;cursor:pointer;user-select:none;min-height:40px;}"
        ".achan-head .achan-tag{font-weight:700;color:var(--accent);font-size:.9em;width:28px;flex:none;}"
        ".achan-head .achan-name{flex:1;color:var(--text);font-size:.9em;min-width:0;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;}"
        ".achan-head .achan-val{font-variant-numeric:tabular-nums;color:#92400e;font-size:.9em;min-width:70px;text-align:right;flex:none;}"
        ".achan-head .achan-caret{color:var(--sub);font-size:10px;transition:transform .15s;flex:none;}"
        ".achan.open .achan-caret{transform:rotate(90deg);}"
        ".achan-body{display:none;padding:14px;border-top:1px solid var(--border);background:var(--card);}"
        ".achan.open .achan-body{display:block;}"
        ".eqn-preview{margin-top:6px;font-size:.85em;color:var(--sub);background:var(--bg);"
        "border:1px solid var(--border);border-radius:6px;padding:6px 8px;}"
        ".eqn-preview b{color:var(--accent);}"
        "@media (max-width:420px){.achan-head{flex-wrap:wrap;row-gap:4px;}.achan-head .achan-name{flex-basis:100%;order:3;white-space:normal;}}"
        // Console log window (Logs page): a terminal panel that scrolls in
        // both directions. Vertically because it holds more rows than fit on
        // screen, horizontally because white-space:pre keeps each console line
        // whole - a log line wrapped at the panel's width would read as two
        // entries and hide which one the timestamp belongs to. Its height
        // tracks the viewport between a floor that still shows a useful number
        // of lines on a phone and the desktop ceiling.
        // The light palette matches the rest of the admin UI's cards while
        // the monospace font keeps a wall of log lines scannable.
        ".log-actions{display:flex;flex-wrap:wrap;align-items:center;gap:12px;margin-bottom:10px;}"
        ".log-actions button{margin-top:0;}"
        ".log-box{height:clamp(220px,55vh,420px);overflow:auto;margin:0;padding:10px;background:#f0f0f0;color:#111111;"
        "font-family:'Consolas','Courier New',monospace;font-size:.78em;line-height:1.35;"
        "white-space:pre;border:1px solid var(--border);border-radius:8px;"
        "-webkit-overflow-scrolling:touch;}"
        // ---------------------------------------------------------------
        // Tablet and phone: the fixed sidebar becomes an off-canvas drawer
        // opened from the burger in the top bar, and the page gets the full
        // width back. The top bar sticks so the drawer can always be reached
        // without scrolling back up a long settings page.
        "@media (max-width:900px){"
        ":root{--gutter:16px;}"
        ".topbar{position:sticky;top:0;z-index:40;}"
        ".nav-burger{display:flex;}"
        ".sidebar{position:fixed;top:0;left:0;bottom:0;z-index:30;width:250px;max-width:80vw;"
        "overflow-y:auto;padding-top:calc(var(--topbar-h) + 12px);border-right:0;"
        "box-shadow:0 0 24px rgba(0,0,0,.18);transform:translateX(-100%);transition:transform .2s ease;}"
        ".nav-toggle:checked~.layout .sidebar{transform:translateX(0);}"
        ".nav-scrim{position:fixed;inset:0;z-index:20;background:rgba(17,24,39,.45);}"
        ".nav-toggle:checked~.layout .nav-scrim{display:block;}"
        ".content{max-width:none;padding:20px var(--gutter);}"
        "}"
        // Phone: tighter cards and headings, one form column per row, and a
        // shorter ellipsis budget for the traffic table's packet cells so a
        // sideways scroll stays short.
        "@media (max-width:600px){"
        "h1{font-size:1.25em;margin-bottom:14px;}"
        "fieldset{padding:16px 14px;margin-bottom:16px;}"
        ".topbar .brand{font-size:.95em;}"
        // The bar is the same height on a phone, but the room beside the logo
        // is not: the burger takes the left of it and the title has to fit in
        // what is left. A shorter logo gives that back, and since the width
        // still follows from the height the image keeps its proportions.
        ".topbar .brand-mark{height:26px;}"
        ".topbar-right{padding:6px 12px;}"
