hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
        ".row{gap:12px;}"
        ".row>div{flex-basis:100%;}"
        ".chat-bubble{max-width:90%;}"
        "#trafficTable td,#trafficTable th:nth-child(4),#trafficTable td:nth-child(4){max-width:220px;}"
        "}"
        // Touch input: the controls get finger-sized, and the text fields get
        // a 16px face because a smaller one makes mobile browsers zoom the
        // page in on focus and leave it zoomed. The toggle switch's own
        // checkbox is re-hidden after the sizing rule above it, since it is
        // painted by its slider rather than by the box itself.
        "@media (pointer:coarse){"
        "input[type=text],input[type=password],input[type=number],select,textarea{font-size:16px;padding:10px 12px;}"
        "input[type=checkbox]{width:20px;height:20px;}"
        ".switch input{width:0;height:0;}"
        "button,.btn{min-height:44px;padding:12px 20px;}"
        ".traffic-actions .btn,.wl-msg-acts button,.log-actions button{min-height:36px;}"
        ".sidebar li a{padding:14px 18px;font-size:.95em;}"
        "}"
        "@media (prefers-reduced-motion:reduce){"
        ".sidebar{transition:none;}"
        "}";
    httpd_resp_set_type(req, "text/css");
    return httpd_resp_sendstr(req, css);
}

esp_err_t web_handle_logo(httpd_req_t *req) {
    httpd_resp_set_type(req, "image/png");
    // The image is part of the firmware, so the only thing that can change it
    // is an OTA update - and an update lands on a fresh boot with the browser
    // reconnecting from scratch. Letting it be cached for a day therefore
    // costs nothing and keeps the logo off the wire on every page load, which
    // matters on a server holding three sockets: an admin page already fetches
    // the stylesheet and three periodic JSON endpoints over the same
    // keep-alive connections.
    httpd_resp_set_hdr(req, "Cache-Control", "public, max-age=86400");
    // Sent whole rather than chunked: the size is known at compile time, so a
    // single send with an explicit length lets the browser see Content-Length
    // and spares the connection the chunked framing.
    return httpd_resp_send(req, (const char *)web_logo_png, WEB_LOGO_PNG_LEN);
}

// ---------------------------------------------------------------- Field helpers
void web_raw(httpd_req_t *req, const char *html) {
    httpd_resp_sendstr_chunk(req, html);
}

// Copy a label or legend into `dst` for rendering, keeping at most
// WEB_LABEL_MAX_BYTES bytes of it. The translation tables are UTF-8, so an
// accented Spanish or Italian character spends two bytes; cutting at a fixed
// byte count could leave a dangling lead or continuation byte that renders as
// a replacement glyph. Backing up over any trailing continuation bytes
// (0b10xxxxxx) and then over their lead byte keeps the copy valid text.
// Every emitter below routes its label through this, so one over-long label
// cannot render differently depending on which control it lands in.
static void label_clamp(char dst[WEB_LABEL_MAX_BYTES + 1], const char *src) {
    if (!src) {
        dst[0] = 0;
        return;
    }
    size_t n = strlen(src);
    if (n > WEB_LABEL_MAX_BYTES) {
        n = WEB_LABEL_MAX_BYTES;
        while (n > 0 && ((unsigned char)src[n] & 0xC0) == 0x80)
            n--;
    }
    memcpy(dst, src, n);
    dst[n] = 0;
}

// Resolves an option's help text from its label and renders the marker for
// it. Every emitter below routes its label through this, so the question mark
// is part of what a labelled control is rather than something a page has to
// remember to ask for, and a label shared by several pages carries the same
// explanation on all of them. A label with no registered help - one assembled
// at run time, for instance - leaves `dst` empty and the option renders
// without a marker.
static void label_help(char dst[WEB_HELP_MARKUP_MAX], const char *label) {
    web_help_markup(dst, WEB_HELP_MARKUP_MAX, web_help_for_label(label));
}

void web_fieldset_open(httpd_req_t *req, const char *legend) {
    char leg[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(leg, legend);
    char buf[WEB_LABEL_MAX_BYTES + 64];
    snprintf(buf, sizeof(buf), "<fieldset><legend>" WEB_LABEL_FMT "</legend>", leg);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_fieldset_close(httpd_req_t *req) {
    httpd_resp_sendstr_chunk(req, "</fieldset>");
}

// Both helpers below render arbitrary, saved user/attacker text (e.g.
// free-text comments, or a WiFi SSID copied from an over-the-air scan
// result) back into an HTML attribute on every GET of the owning page. That
// text is HTML-escaped here, once, so no caller has to remember to do it:
// escaping at only some call sites would let a quote/angle-bracket character
// in a comment, status, filter, hostname or WiFi SSID field break out of
// value='...' and inject markup/script that then ran in the admin's
// authenticated session on the next page load.
void web_field_text(httpd_req_t *req, const char *label, const char *name, const char *value, int maxlen) {
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    web_field_text_h(req, label, name, value, maxlen, hlp);
}

// The `_h()` variants below all take the help marker ready-rendered instead of
// resolving it from the label. A page reaches for one where its label is built
// at run time - a numbered alias or budlist row, a payload-type filter - since
// such a label matches no entry in the help table and would otherwise render
// with no question mark at all.
void web_field_text_h(httpd_req_t *req, const char *label, const char *name, const char *value, int maxlen, const char *help_markup) {
    char esc[512];
    web_html_attr_escape(value ? value : "", esc, sizeof(esc));
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 576];
    snprintf(buf, sizeof(buf), "<label>" WEB_LABEL_FMT WEB_HELP_FMT "</label><input type='text' name='%.30s' value='%.400s' maxlength='%d'>", lbl,
             help_markup ? help_markup : "", name, esc, maxlen);
    httpd_resp_sendstr_chunk(req, buf);
}

// Both numeric emitters below always render the field's accepted range as HTML
// min/max attributes, so every numeric input on every page is validated by the
// browser before the form is submitted. The bounds are supplied by the caller
// because they belong to the field's own value domain, and the caller is what
// also clamps the posted value server-side: the browser check is the first
// line of defence against a typo, the handler's clamp is the one that holds
// against a crafted POST.

// Number of digits after the decimal point in a step string such as "0.0001"
// or "1" (0 digits). Returns 6 for "any" (the HTML5 sentinel meaning
// unrestricted precision) or for a value with a decimal point but no digits
// after it, since those are the only two callers that want full float
// precision rather than a fixed decimal count.
static int step_decimals(const char *step) {
    if (!step || strcmp(step, "any") == 0)
        return 6;
    const char *dot = strchr(step, '.');
    if (!dot)
        return 0;
    int n = 0;
    for (const char *p = dot + 1; *p >= '0' && *p <= '9'; p++)
        n++;
    return n > 0 ? n : 6;
}

void web_field_int(httpd_req_t *req, const char *label, const char *name, long value, long min, long max) {
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    web_field_int_h(req, label, name, value, min, max, hlp);
}

