hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
void web_field_int_h(httpd_req_t *req, const char *label, const char *name, long value, long min, long max, const char *help_markup) {
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 192];
    snprintf(buf, sizeof(buf), "<label>" WEB_LABEL_FMT WEB_HELP_FMT "</label><input type='number' name='%.30s' value='%ld' min='%ld' max='%ld'>", lbl,
             help_markup ? help_markup : "", name, value, min, max);
    httpd_resp_sendstr_chunk(req, buf);
}

// Renders the value with exactly as many decimal digits as the step
// attribute itself specifies (e.g. step="0.0001" -> 4 decimals, step="1" ->
// 0 decimals). A field pre-filled with fewer significant digits than that -
// the failure mode of a plain "%g", which drops to 3 decimals past 100 - or
// with more decimals than the step allows leaves a value the browser's own
// step check rejects, blocking every subsequent Save until the field is
// retyped by hand.
void web_field_float(httpd_req_t *req, const char *label, const char *name, float value, const char *step, float min, float max) {
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    int decimals = step_decimals(step);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 192];
    snprintf(buf, sizeof(buf), "<label>" WEB_LABEL_FMT WEB_HELP_FMT "</label><input type='number' step='%.10s' name='%.30s' value='%.*f' min='%g' max='%g'>",
             lbl, hlp, step ? step : "0.01", name, decimals, (double)value, (double)min, (double)max);
    httpd_resp_sendstr_chunk(req, buf);
}

// Renders as an iOS-style toggle switch (track+knob) driven purely by
// :checked in CSS: the extra <span> wrappers around the input are decorative
// only, and the field's name/checked semantics are exactly what a bare
// checkbox would post. Reserved for a checkbox that represents a single on/off
// feature enable; a checkbox that is one of several options in a multi-select
// list uses web_field_checkbox_plain() instead, so it still reads as a list
// rather than a bank of independent switches.
void web_field_checkbox(httpd_req_t *req, const char *label, const char *name, bool checked) {
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 224];
    snprintf(buf, sizeof(buf),
             "<label class='switch-row'><span class='switch'><input type='checkbox' name='%.30s' %s>"
             "<span class='slider'></span></span><span class='switch-label'>" WEB_LABEL_FMT WEB_HELP_FMT "</span></label>",
             name, checked ? "checked" : "", lbl, hlp);
    httpd_resp_sendstr_chunk(req, buf);
}

// Same field as web_field_checkbox(), rendered as a bare checkbox instead of a
// toggle switch. Used for a checkbox that is one entry in a multi-select list
// (e.g. a payload-type filter or a path alias) rather than a single feature's
// on/off state, since a bank of switches would misrepresent that as several
// independent settings instead of one selection among peers.
void web_field_checkbox_plain(httpd_req_t *req, const char *label, const char *name, bool checked) {
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    web_field_checkbox_plain_h(req, label, name, checked, hlp);
}

void web_field_checkbox_plain_h(httpd_req_t *req, const char *label, const char *name, bool checked, const char *help_markup) {
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 128];
    snprintf(buf, sizeof(buf), "<label><input type='checkbox' name='%.30s' %s> " WEB_LABEL_FMT WEB_HELP_FMT "</label>", name, checked ? "checked" : "", lbl,
             help_markup ? help_markup : "");
    httpd_resp_sendstr_chunk(req, buf);
}

void web_field_path_checkboxes(httpd_req_t *req, const char *name_prefix, uint8_t mask) {
    char group_help[WEB_HELP_MARKUP_MAX];
    web_help_markup(group_help, sizeof(group_help), web_help_for_label(TR_F_PATH));
    char buf[WEB_HELP_MARKUP_MAX + 160];
    snprintf(buf, sizeof(buf), "<label>%.100s" WEB_HELP_FMT "</label>", TR_F_PATH, group_help);
    httpd_resp_sendstr_chunk(req, buf);

    // Each box's own label is "Path N", optionally followed by the alias that
    // preset currently holds, so it never matches an entry in the help table.
    // All four share one explanation, resolved once here from the group label
    // the boxes sit under.
    char box_help[WEB_HELP_MARKUP_MAX];
    web_help_markup(box_help, sizeof(box_help), web_help_for_label(TR_F_OBJITEM_PATH_FMT));

    char aliases[4][72];
    app_config_lock();
    for (int i = 0; i < 4; i++) {
        strncpy(aliases[i], g_config.path[i], sizeof(aliases[i]) - 1);
        aliases[i][sizeof(aliases[i]) - 1] = 0;
    }
    app_config_unlock();

    for (int k = 0; k < 4; k++) {
        // Sized to hold the escaped alias plus the "Path N (...)" wrapper so
        // the ESP-IDF -Wformat-truncation error cannot fire; the checkbox
        // helper caps the displayed label length itself.
        char plabel[72 * 6 + 32];
        if (aliases[k][0]) {
            char pesc[72 * 6 + 1];
            web_html_attr_escape(aliases[k], pesc, sizeof(pesc));
            snprintf(plabel, sizeof(plabel), TR_F_OBJITEM_PATH_FMT " (%s)", k + 1, pesc);
        } else {
            snprintf(plabel, sizeof(plabel), TR_F_OBJITEM_PATH_FMT, k + 1);
        }
        char name[48];
        snprintf(name, sizeof(name), "%.30s%d", name_prefix, k + 1);
        web_field_checkbox_plain_h(req, plabel, name, (mask & (1u << k)) != 0, box_help);
    }
}

uint8_t web_form_get_path_mask(const char *body, const char *name_prefix) {
    uint8_t mask = 0;
    for (int k = 0; k < 4; k++) {
        char name[48];
        snprintf(name, sizeof(name), "%.30s%d", name_prefix, k + 1);
        if (web_form_get_bool(body, name))
            mask |= (uint8_t)(1u << k);
    }
    return mask;
}

void web_select_open(httpd_req_t *req, const char *label, const char *name) {
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    web_select_open_h(req, label, name, hlp);
}

