hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
void web_select_open_h(httpd_req_t *req, const char *label, const char *name, const char *help_markup) {
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 128];
    snprintf(buf, sizeof(buf), "<label>" WEB_LABEL_FMT WEB_HELP_FMT "</label><select name='%.30s'>", lbl, help_markup ? help_markup : "", name);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_select_option(httpd_req_t *req, int value, const char *label, bool selected) {
    web_select_option_state(req, value, label, selected, false);
}

void web_select_option_state(httpd_req_t *req, int value, const char *label, bool selected, bool disabled) {
    char buf[400];
    snprintf(buf, sizeof(buf), "<option value='%d' %s %s>%.300s</option>", value, selected ? "selected" : "", disabled ? "disabled" : "", label);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_select_close(httpd_req_t *req) {
    httpd_resp_sendstr_chunk(req, "</select>");
}

// ---------------------------------------------------------------- GPIO registry
// Every GPIO field g_config currently has, grouped by the feature that owns
// it. This is the ONLY place that mapping lives - a page's GPIO <select>
// never has to know about another page's fields directly, it just asks this
// registry (via web_gpio_owner_tag()) whether a given pin is free.
//
// Entries whose feature has an on/off toggle are only reported while that
// toggle is enabled (a disabled feature doesn't really "hold" its pin); the
// always-on RF module / audio path / message alarm pins, and the sensor
// bus's compile-time-fixed I2C pins, are reported unconditionally.
int web_gpio_collect_used(const char *skip_tag, web_gpio_owner_t *out, int max) {
    int n = 0;

#define WEB_GPIO_ADD(gpio_value, owner_tag)                                                                                                                    \
    do {                                                                                                                                                       \
        int8_t _g = (int8_t)(gpio_value);                                                                                                                      \
        if (n < max && _g >= 0 && (!skip_tag || strcmp((owner_tag), skip_tag) != 0)) {                                                                         \
            out[n].gpio = _g;                                                                                                                                  \
            out[n].tag = (owner_tag);                                                                                                                          \
            n++;                                                                                                                                               \
        }                                                                                                                                                      \
    } while (0)

    // msg_alarm_gpio can hold a real pin number even while the Message Alarm
    // "Enable" checkbox is off (Save doesn't clear it, so re-enabling later
    // keeps the same pin) - only count it as reserved while actually enabled.
    if (g_config.msg_alarm_enable)
        WEB_GPIO_ADD(g_config.msg_alarm_gpio, "Message Alarm");

    // Audio front-end and PTT: all fixed at compile time
    // (esp32idf_radioamateur_modem_config.h / the top-level CMakeLists.txt),
    // always reserved - the modem's ADC/DAC/PTT trio is hardwired on the
    // board. PTT is a compile-time constant like its ADC/DAC siblings and is
    // reported the same way they are - always shown as "used" here so it
    // correctly greys out in every other GPIO picker (e.g. Message Alarm)
    // even though it has no web-admin field of its own.
    WEB_GPIO_ADD(MODEM_ADC_GPIO, "Radio Modem");
    WEB_GPIO_ADD(MODEM_DAC_GPIO, "Radio Modem");
    WEB_GPIO_ADD(MODEM_PTT_GPIO, "PTT");

    // Local sensor I2C bus: fixed at compile time (sensors_local_i2c.h),
    // always reserved regardless of any run-time enable flag and of which
    // sensor drivers are compiled in - the bus belongs to the board's wiring,
    // not to any one chip on it.
    WEB_GPIO_ADD(SENSORS_LOCAL_I2C_SDA_GPIO, "Sensor I2C");
    WEB_GPIO_ADD(SENSORS_LOCAL_I2C_SCL_GPIO, "Sensor I2C");

    // GNSS receiver serial port: fixed at compile time (gps.h), always
    // reserved. Both pins are listed, not just the one carrying sentences:
    // the transmit pin is physically wired to the module's input on this
    // board, so handing it to another peripheral would drive that input.
    WEB_GPIO_ADD(GPS_UART_RX_GPIO, "GPS");
    WEB_GPIO_ADD(GPS_UART_TX_GPIO, "GPS");

#undef WEB_GPIO_ADD
    return n;
}

const char *web_gpio_owner_tag(int gpio, const char *skip_tag) {
    web_gpio_owner_t used[WEB_GPIO_MAX_OWNERS];
    int n = web_gpio_collect_used(skip_tag, used, WEB_GPIO_MAX_OWNERS);
    for (int i = 0; i < n; i++) {
        if (used[i].gpio == gpio)
            return used[i].tag;
    }
    return NULL;
}

// ---------------------------------------------------------------- Symbol picker
void web_field_symbol(httpd_req_t *req, const char *label, const char *name_prefix, const char *sym2) {
    char table_ch[2] = { (sym2 && sym2[0]) ? sym2[0] : '/', 0 };
    char sym_ch[2] = { (sym2 && sym2[1]) ? sym2[1] : '&', 0 };
    int table_num = (table_ch[0] == '\\') ? 2 : 1;
    int code_num = (int)(unsigned char)sym_ch[0];

    char ids[64];
    snprintf(ids, sizeof(ids), "%.30sTable", name_prefix);
    char idc[64];
    snprintf(idc, sizeof(idc), "%.30sCode", name_prefix);

    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);

    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 1536];
    snprintf(buf, sizeof(buf),
             "<label>" WEB_LABEL_FMT WEB_HELP_FMT "</label>"
             "<div style='display:flex;gap:6px;align-items:center'>"
             "<span id='%.30s_icn' style='display:inline-flex;align-items:center;justify-content:center;width:34px;height:34px;"
             "border-radius:6px;background:#dcfce7;overflow:hidden;flex:none'>"
             "<img id='%.30s_img' src='http://aprs.dprns.com/symbols/icons/%d-%d.png' width=32 height=32 style='display:block' "
             "onerror=\"this.style.display='none'\">"
             "</span>"
             "<span style='font-size:12px;color:var(--sub)'>%.60s:</span>"
             "<input type='text' id='%.30s' name='%.30s' value='%.4s' maxlength='1' style='width:3em;text-align:center' "
             "oninput=\"aprsSymUpd('%.30s','%.30s')\">"
             "<span style='font-size:12px;color:var(--sub)'>%.60s:</span>"
             "<input type='text' id='%.30s' name='%.30s' value='%.4s' maxlength='1' style='width:3em;text-align:center' "
             "oninput=\"aprsSymUpd('%.30s','%.30s')\">"
             "<a href='/symbol' target='_blank' title='%.60s' class='secondary' style='text-decoration:none;padding:4px 8px'>%.60s</a>"
             "</div>",
             lbl, hlp, name_prefix, name_prefix, code_num, table_num, TR_F_SYMBOL_TABLE, ids, ids, table_ch, ids, idc, TR_F_SYMBOL_CODE, idc, idc, sym_ch, ids,
             idc, TR_SYM_PICK_HINT, TR_BTN_PICK_SYMBOL);
    httpd_resp_sendstr_chunk(req, buf);

